Repository: 84000/data-translation-memory
Catalog: toh162-v4.tmx
Source language: bo
Languages: en

source: ༄༅༅། །རྒྱ་གར་སྐད་དུ། ཨཱརྱ་ཤྲཱི་བ་སུ་པ་རི་པྲྀཙྪཱ་ནཱ་མ་མ་ཧཱ་ཡཱ་ན་སཱུ་ཏྲ། བོད་སྐད་དུ། འཕགས་པ་དཔལ་དབྱིག་གིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra The Questions of Śrīvasu

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas.

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་བཱ་རཱ་ཎ་སཱི་ན་དྲང་སྲོང་སྨྲ་བ་རི་དགས་ཀྱི་ནགས་ན་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ། དེ་ནས་ཚོང་དཔོན་གྱི་བུ་དཔལ་དབྱིག་ཅེས་བྱ་བ། བཱ་རཱ་ཎ་སཱིའི་གྲོང་ཁྱེར་ཆེན་པོ་ནས་བྱུང་ནས།
en: The Blessed One was in the Ṛṣivadana in the Deer Park at Vārāṇasī, together with a gathering of bodhisattvas and a great assembly of hearers, when a merchant son named Śrīvasu arrived from the city of Vārāṇasī.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། ྱ
en: He walked to where the Blessed One was, and after bowing his head at the Blessed One’s feet, offering prostrations, and making three circumambulations, he sat to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཚོང་དཔོན་གྱི་བུ་དཔལ་དབྱིག་གིས། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་འདས་ཤིང་གཤེགས་ལགས།
en: Then, with his hands folded, the merchant son Śrīvasu bowed in front of the Blessed One and asked, “Blessed One, how many thus-gone ones, worthy ones, fully awakened ones have passed and gone?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཚོང་དཔོན་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་འདས་ཤིང་གཤེགས་ཏེ།
en: The Blessed One said, “Merchant son, innumerable and countless thus-gone ones, worthy ones, fully awakened ones have passed and gone;

source: དཔེར་ན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དོ། །གསོལ་པ།
en: that is, as many as there are grains of sand in the Ganges river.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་སྐྱེ་ཞིང་འབྱུང་བར་འགྱུར་ལགས།
en: The merchant son Śrīvasu asked, “Blessed One, how many thus-gone ones, worthy ones, fully awakened ones will be born and appear?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལགས།
en: How many thus-gone ones, worthy ones, fully awakened ones are alive and present now?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཚོང་དཔོན་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔག་ཏུ་མེད་གྲངས་མེད་པ་སྐྱེ་ཞིང་འབྱུང་བར་འགྱུར་ཏེ།
en: The Blessed One said, “Merchant son, innumerable and countless thus-gone ones, worthy ones, fully awakened ones will be born and appear;

source: དཔེར་ན་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དོ།
en: that is, as many as there are grains of sand in the Ganges river.

source: །ཚོང་དཔོན་གྱི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དཔག་ཏུ་མེད། གྲངས་མེད་པ་ད་ལྟར་བཞུགས་ལ་འཚོ་ཞིང་གཞེས་ཏེ།
en: Merchant son, innumerable and countless thus-gone ones, worthy ones, fully awakened ones are alive and present now;

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚོང་དཔོན་གྱི་བུ་དཔལ་དབྱིག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་ལྟར་མི་བརྒྱའམ། མི་སྟོང་ངམ། མི་འབུམ་གྱིས་སྔོན་འབད་དེ་བཙལ་བས་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ན། བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་འབད་དེ་བཙལ་ན་ཅིའི་སླད་དུ།
en: When the Blessed One had spoken thus, the merchant son Śrīvasu asked him, “Blessed One, if a hundred people, a thousand people, a hundred thousand people attained perfect awakening by having striven diligently in the past, then, Blessed One, why would I not attain the same if I were to strive diligently?

source: དེ་མི་ཐོབ། མི་རྟོགས་ཀྱིས་དེའི་སླད་དུ་ཐུགས་བརྩེ་བར་དགོངས་ཏེ་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་བགྱི་བ་དང་། ཇི་ལྟར་གནས་པར་བགྱི་བ་དང་། ཇི་ལྟར་བསྒྲུབ་པར་བགྱི་བ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་དེ་ལྟར་ལེགས་པར་བསྟན་དུ་གསོལ།
en: Since I have not yet understood, I request you, Blessed One, to think of me with your kind heart and show me properly what novice bodhisattvas should do, what they should dwell upon, and what they should practice.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་དཔལ་དབྱིག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཚོང་དཔོན་གྱི་བུ་ལེགས་སོ་ལེགས་སོ།
en: At this request, the Blessed One said to the merchant son Śrīvasu, “Excellent, merchant son, excellent.

source: །ཁྱོད་ཀྱིས་རྟོག་པ་མཛེས་སོ། །སྤོབས་པ་དགེའོ།
en: Your thought is beautiful and your eloquence virtuous.

source: །ཚོང་དཔོན་གྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ཇི་ལྟར་བྱ་བ་དང་། ཇི་ལྟར་གནས་པར་བྱ་བ་དང་། ཇི་ལྟར་བསྒྲུབ་པར་བྱ་བ་ངས་ཁྱོད་ལ་བཤད་དོ།
en: Therefore, merchant son, listen carefully and keep this in your mind, as I tell you what novice bodhisattvas should do, what they should dwell upon, and what they should practice.”

source: །བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ་ཚོང་དཔོན་གྱི་བུ་དཔལ་གྱི་དབྱིག་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: “Excellent, Blessed One,” said the merchant son Śrīvasu, and he listened to the Blessed One.

source: །ཚོང་དཔོན་གྱི་བུ་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་ཉིན་གཅིག་བཞིན་དུ་སྙིང་ཐག་པ་རུས་པའི་ཁོང་ནས་ཡིད་ལ་བྱས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསམས་ནས་དུས་གསུམ་དུ་དཀོན་མཆོག་གསུམ་ལ་མཆོད་པ་དང་རིམ་གྲོ་བྱ་བ་མི་གཏང་བར་བྱའོ།
en: The Blessed One then said to him, “Merchant son, thinking with full attention, novice bodhisattvas should never give up venerating and honoring the Three Jewels three times each day, turning their whole mind to that from the depth of their hearts and the very marrow of their bones.

source: །ཚོང་དཔོན་གྱི་བུ་གཞན་ཡང་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་སྙིང་ཐག་པ་རུས་པའི་ཁོང་ནས་ཡིད་ལ་བྱས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསམས་ནས་དུས་གསུམ་དུ་དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་འགྲོ་བའི་ཡི་དམ་མི་གཏང་བར་བྱའོ།
en: “Moreover, thinking with full attention, novice bodhisattvas should never give up their oath to take refuge in the Three Jewels three times each day, turning their whole mind to that from the depth of their hearts and the very marrow of their bones.

source: །ཚོང་དཔོན་གྱི་བུ་གཞན་ཡང་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་སྙིང་ཐག་པ་རུས་པའི་ཁོང་ནས་ཡིད་ལ་བྱས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསམས་ནས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་དཀོན་མཆོག་གསུམ་གྱིས་མི་སྟོང་བར་དུས་གསུམ་དུ་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: “Moreover, merchant son, thinking with full attention, novice bodhisattvas should never give up praying three times every day that all the world systems may never be without the Three Jewels, turning their whole mind to that from the depth of their hearts and the very marrow of their bones.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་དཀོན་མཆོག་གསུམ་བསྐལ་པ་དུ་མར་གནས་པར་དུས་གསུམ་དུ་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: They should never give up praying three times that the Three Jewels may remain in all the world systems for many eons.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་བསྐལ་པ་དུ་མར་ཆོས་བསྟན་པར་དུས་གསུམ་དུ་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: They should never give up praying three times that the Dharma may be taught to all sentient beings in all world systems for many eons.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་ཅི་ནུས་པ་དང་། ཅི་ལྕོགས་པ་དང་། ཇི་ལྟར་གསོལ་བ་འདེབས་པ་བཞིན་དུ་ཐེག་པ་གསུམ་ལ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་དུས་གསུམ་དུ་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: They should never give up praying three times that all sentient beings in all world systems may generate the mind of awakening within the Three Vehicles according to their ability, strength, and aspiration.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཁོངས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བའི་ཕྱིར་དགེ་བའི་རྩ་བ་ཐམས་ཅད་མྱུར་ཞིང་རིངས་པར་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བར་དུས་གསུམ་དུ་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: They should never give up praying three times that all their roots of virtue may swiftly and promptly be completed so that all sentient beings in all world systems may be liberated.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཁོངས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་གསུམ་ཐོབ་པར་འགྱུར་བར་དུས་གསུམ་དུ་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: They should never give up praying three times that all sentient beings in all world systems may attain the three types of awakening.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཁོངས་སུ་གཏོགས་པའི་སེམས་ཅན་ངན་འགྲོར་སྐྱེས་པ་ཐམས་ཅད་ངན་འགྲོ་ཐམས་ཅད་ནས་གདོན་པར་དུས་གསུམ་དུ་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: They should never give up praying three times that all sentient beings in all world systems who have taken birth in the lower realms may be rescued from the lower realms.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་ཁོངས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡིག་པ་ཐམས་ཅད་སྤོང་བར་འགྱུར་བར་དུས་གསུམ་དུ་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: They should never give up praying three times that all sentient beings in all world systems may abandon all unwholesome actions.

source: །འཇིག་པ་ཐམས་ཅད་སྤོང་བར་འགྱུར་བར་གསོལ་བ་གདབ་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་སྤོང་བར་འགྱུར་བ་དུས་གསུམ་དུ་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: They should never give up praying three times that they may be rid of all fear, suffering, unhappiness, and strife.

source: །འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་སངས་རྒྱས་དང་། འཕགས་པ་ཉན་ཐོས་ལ་སོགས་པ་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་དུས་གསུམ་དུ་རྗེས་སུ་ཡི་རང་བ་མི་གཏང་བར་བྱའོ།
en: They should never give up rejoicing three times in the roots of virtue of all the buddhas of the past, present, and future, in those of all bodhisattvas, solitary buddhas, noble hearers and so forth, and in those of all sentient beings.

source: །ཚོང་དཔོན་གྱི་བུ་གཞན་ཡང་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་སྙིང་ཐག་པ་རུས་པའི་ཁོང་ནས་ཡིད་ལས་བྱས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསམས་ནས་དུས་གསུམ་དུ་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་པ་དང་། བདག་ཉིད་སྡིག་པའི་སྤྱོད་པ་ལ་རྣམ་པར་སྨོད་པ་དང་། སྡིག་པ་སྤྱོད་པ་ལ་བཤུང་བ་དང་། སྡིག་པ་ལས་ངེས་པར་འབྱུང་བ་དང་། དགེ་བ་ཐམས་ཅད་འདོད་པ་དང་། དགེ་བ་ཐམས་ཅད་བླང་བ་དང་། ཚེ་རབས་ཚེ་རབས་སུ་ཡང་དཀོན་མཆོག་གསུམ་ལ་བསྙེན་བཀུར་བྱ་བར་གསོལ་བ་གདབ་པ་དང་། གཅིག་ཏུ་ངེས་པར་རྣམ་པར་དག་པའི་དགེ་བའི་སྤྱད་པ་སྤྱོད་པར་གསོལ་བ་གདབ་པ་དང་། ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་གསོལ་བ་གདབ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་འཐོབ་པར་གསོལ་བ་གདབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གསོལ་བ་གདབ་པ་དང་། བསྐལ་པ་དུ་མར་ཆོས་བསྟན་པར་གསོལ་བ་གདབ་པ་མི་གཏང་བར་བྱའོ།
en: “Also, merchant son, thinking with full attention, novice bodhisattvas should make the aspiration, three times every day, to attain perfect awakening, turning their whole mind to it from the depth of their hearts and the very marrow of their bones. They should never give up criticizing their own unwholesome actions, deploring and renouncing them, while desiring and taking up all virtuous actions. They should never give up praying that, life after life, they may serve and attend to the Three Jewels, engage in virtuous conduct that is totally pure, complete the collection of merit for perfect awakening, achieve all the qualities of a buddha, turn the wheel of the Dharma, and teach the Dharma for many eons.

source: །ཚོང་དཔོན་གྱི་བུ་གཞན་ཡང་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་ཕ་མ་ལ་གནོད་པ་མེད་པ་དང་། བུ་དང་། ཆུང་མ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བ་དང་། མཛའ་བོ་དང་། བློན་པོ་དང་། ཉེ་དུ་དང་། རྒན་རབས་ལ་གནོད་པ་མེད་པར་ཇི་ལྟར་མོས་པ་དང་། ཅི་ནུས་པར་དུས་དུས་སུ་སྦྱིན་པ་སྦྱིན་པར་བྱའོ།
en: “Also, merchant son, novice bodhisattvas should not harm their parents. They should not harm their children, wives, male servants, female servants, laborers, employees, friends, ministers, relatives, or elders. Rather, they should always give them whatever they wish for, as much as they possibly can.

source: །ཚོང་དཔོན་གྱི་བུ་གཞན་ཡང་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔས་ནི་བསླབ་པའི་གཞི་ལྔ་ལ་གནས་ཞིང་འདུག་པ་དང་། བརྟན་པོར་འདུག་པ་དང་། མི་ལྷོད་པར་འདུག་པར་བསླབ་པར་བྱའོ།
en: “Also, merchant son, novice bodhisattvas should abide by the five precepts and practice in remaining firm and steadfast in them.

source: །གལ་ཏེ་བསླབ་པའི་གཞི་ལྔ་ལ་སློབ་མི་ནུས་ན་ཡང་། དེས་བཞིའམ། གསུམ་མམ། གཉིས་སམ།
en: In case they are not able to practice all five precepts, they should practice four, three, two, or at least one of them.

source: དེའི་ནང་ནས་བསླབ་པའི་གཞི་གཅིག་ཙམ་ལ་ཡང་བསླབ་པར་བྱའོ། །གལ་ཏེ་བསླབ་པའི་གཞི་གཅིག་ཙམ་ལ་སློབ་ཀྱང་མི་ནུས་ན་དེ་སྡིག་པའི་ལས་མི་དགེ་བ་གང་དང་གང་ཀུན་ཏུ་སྤྱོད་པ་དེ་ལ་ཞེན་པ་མ་ཡིན་པ་དང་། དྲག་པོ་མ་ཡིན་པའི་སེམས་དང་། མི་དགའ་བ་ཞེན་པ་དང་། ལྷོད་པ་དང་། ཡང་བའི་སེམས་དང་། དོན་གྱི་དབང་དང་། དགོས་པའི་དབང་གིས་སྤྱད་པར་བྱ་སྟེ།
en: If they cannot practice even one precept, but engage in this or that nonvirtuous action, they should only do so when forced to for some reason, and should do so with a purpose, with a mind that is without craving and aggression, with a mind that is not lax, careless, and attached to what is pleasant.

source: དེས་མི་དགེ་བ་བཅུའི་ལས་ཁྲོ་བའི་དབང་དུ་གྱུར་པ་དང་། འཁོན་དུ་འཛིན་པའི་དབང་དུ་གྱུར་པ་དང་། དགའ་བ་དང་མཆོག་ཏུ་དགའ་བའི་དབང་དུ་གྱུར་པས་ཀུན་ཏུ་སྤྱད་པར་མི་བྱའོ།
en: They should not engage in the ten nonvirtuous actions under the power of anger, under the power of resentment, or under the power of taking joy or delight in them.

source: །ཀུན་ཏུ་སྤྱད་པར་འདོད་པ་ན་ཡང་རྣམ་པར་སྨད་པར་བྱ། རྣམ་པར་བཤུང་བར་བྱའོ། །སྤྱོད་ཅིང་འདུག་པ་ན་ཡང་རྣམ་པར་སྨད་པར་བྱ། རྣམ་པར་བཤུང་བར་བྱའོ། །སྤྱད་ཟིན་པ་ན་ཡང་རྣམ་པར་སྨད་པར་བྱ། རྣམ་པར་བཤུང་བར་བྱ། སོ་སོར་བཤགས་པར་བྱ། ངེས་པར་འབྱུང་བར་བྱའོ།
en: When they are about to engage in them, they should criticize and denounce them. While they are engaging in them, they should criticize and denounce them. When they have finished engaging in them, they should criticize and denounce them, and they should confess them individually and renounce them.

source: །ལེགས་པ་དགེ་བ་ཅི་ཡང་རུང་བ་ཞིག །ཀུན་ཏུ་སྤྱོད་པ་ན་ཡང་དེས་ནི་དེ་ལ་སེམས་ཞེན་པ་དང་། དྲག་པོའི་སེམས་དང་། ཚིམ་པ་དང་། མགུ་བ་དང་། ལྷོད་པ་མ་ཡིན་པ་དང་། ཡང་བ་མ་ཡིན་པ་དང་། བར་ཆད་མེད་པ་དང་། དད་པ་དང་། དགའ་བ་དང་། དང་བ་དང་། མཆོག་ཏུ་དགའ་བའི་དབང་དུ་གྱུར་པའི་སེམས་ཀྱིས་ཀུན་ཏུ་སྤྱད་པར་བྱའོ།
en: “When they engage in any wholesome, virtuous action, they should do so with a fervent and powerful mind. Not remaining content and satisfied, not being lax and careless, they should engage in the action unimpededly with a mind empowered by faith, joy, sincerity, and delight.

source: །ཀུན་ཏུ་སྤྱོད་པར་འདོད་པ་ན་ཡང་སྙིང་ཐག་པ་རུས་པའི་ཁོང་ནས་ཡིད་ལ་བྱས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསམས་ནས་སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བའི་ཕྱིར་དང་། དགྲོལ་བའི་ཕྱིར་དང་། དབུགས་དབྱུང་བའི་ཕྱིར་དང་། ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱ་བའི་ཕྱིར་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: When they are about to engage in such an action, they should then turn their whole mind to it from the depth of their hearts and the very marrow of their bones and, thinking with full attention, completely dedicate it to unsurpassed and perfect awakening in order to liberate all sentient beings, to free them, to bring them relief, to help them pass beyond sorrow, to help them accomplish the state of omniscience, and to enable them to attain all the qualities of a buddha.

source: །དེས་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པ་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་ཐམས་ཅད་ལ་ཡང་སྙིང་ཐག་པ་རུས་པའི་ཁོང་ནས་ཡིད་ལ་བྱས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བསམས་ནས་མངོན་པར་བསྡུས་ཏེ་བཟླུམས་ནས་རྗེས་སུ་ཡི་རང་བར་བྱའོ།
en: “Turning their whole mind, from the depth of their hearts and the very marrow of their bones, to all their virtuous actions of the past, present, and future, and thinking of them with full attention they should bring them all together and rejoice in them.

source: །རྗེས་སུ་ཡི་རང་བའི་མཆོག་དང་། ཕུལ་དང་། གཙོ་བོ་དང་། རབ་དང་། རབ་མཆོག་དང་། གྱ་ནོམ་པ་དང་། དམ་པ་དང་། མཉམ་པ་མེད་པ་དང་། མི་མཉམ་པ་དང་། མཉམ་པ་དང་། ནམ་མཁའ་དང་མཉམ་པ་དང་། མྱ་ངན་ལས་འདས་པ་དང་། མཉམ་པའི་རྗེས་སུ་ཡི་རང་བས་རྗེས་སུ་ཡི་རང་བར་བྱའོ།
en: They should rejoice with the most excellent rejoicing, with the best, the foremost, the highest, the very highest, sublime, and supreme rejoicing that is unequaled, equal to the unequaled, equal to space, and equal to nirvāṇa.

source: །རྗེས་སུ་ཡི་རངས་ནས་ཀྱང་དགེ་བ་ཀུན་ཏུ་སྤྱད་པ་དེ་ཡང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་སངས་རྒྱས་དང་། ཉན་ཐོས་ཐམས་ཅད་ལ་དབུལ་བར་བྱའོ། །ཕུལ་ནས་ཀྱང་སེམས་ཅན་ཐམས་ཅད་དང་ཐུན་མོང་དུ་བྱ་ཞིང་།
en: After rejoicing, they should offer that act of virtue to the buddhas, bodhisattvas, solitary buddhas, and hearers and, having offered it, share it with all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་བའི་ཕྱིར་དང་། དགྲོལ་བའི་ཕྱིར་དང་། དབུགས་དབྱུང་བའི་ཕྱིར་དང་། ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བའི་ཕྱིར་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་འཐོབ་པར་བྱ་བའི་ཕྱིར་ཉིན་གཅིག་བཞིན་དུ་དུས་གསུམ་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: Three times a day, they should make this dedication to unsurpassed and perfect awakening in order to liberate all sentient beings, free them, bring them relief, help them pass beyond sorrow, help them accomplish all the qualities of a buddha, and enable them to attain the state of omniscience.

source: །དེས་ཀ་ཤི་ཀའི་གོས་དང་། ཙན་དན་དང་། ཨ་ག་རུའི་བདུག་པ་ལ་སོགས་པ་དང་། ཡོ་བྱད་རྣམ་པ་སྣ་ཚོགས་ཉམས་སུ་མྱོང་ངམ། འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་དགའ་མགུར་སྤྱོད་དམ། ལམ་དུ་འགྲོ་བའམ། འདུ་བྱེད་དམ། བྱ་བ་ཐམས་ཅད་བྱེད་པ་ན་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འདུན་པ་དང་། དད་པ་དང་། དོན་དུ་གཉེར་བ་དང་། སྨོན་པ་དེ་འབའ་ཞིག་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་རྗེས་སུ་དྲན་པར་བྱའོ།
en: “Even while enjoying various kinds of goods such as garments from Kāśī and incense of sandalwood and aloeswood, and even while enjoying the five sense pleasures, while traveling, or while engaging in any activity or pursuit, they should always solely and unceasingly remember their strong wish, devotion, desire, and aspiration for unsurpassed and perfect awakening.

source: །ཡིད་ལ་བྱའོ། །བསྒོམ་པར་བྱའོ། །ལན་མང་དུ་བྱའོ།
en: They should contemplate and meditate on it and do so repeatedly.

source: །དེ་ལྟར་བྱས་ན་དེ་སྡིག་པ་མི་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པ་རྣམས་ལ་སེམས་ལྷོད་པར་འགྱུར། ཡང་བར་འགྱུར། ཆུང་བར་འགྱུར། སྲབ་པར་འགྱུར། གསོག་ཏུ་འགྱུར་རོ། །ལེགས་པར་དགེ་བའི་ལས་ཀུན་ཏུ་སྤྱོད་པ་རྣམས་ལ་ནི་སེམས་ཞེན་པར་འགྱུར། དྲག་པར་འགྱུར། མི་ལྷོད་པར་འགྱུར། མི་ཡང་བར་འགྱུར། མི་ཆུང་བར་འགྱུར་རོ།
en: By doing so, the intent on unwholesome, nonvirtuous actions becomes loosened, lessened, diminished, attenuated, and feeble, while the intent on wholesome, virtuous actions becomes adamant, fervent, strong, firm, and great.

source: །དེ་སྡིག་པ་མི་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པ་རྣམས་ལ་ལྷོད་པར་འགྱུར། ཡང་བར་འགྱུར། ཆུང་བར་འགྱུར། སྲབ་པར་འགྱུར། གསོག་ཏུ་འགྱུར། མེད་པར་འགྱུར་བ་དང་།
en: “When the intent on unwholesome, nonvirtuous actions becomes loosened, lessened, diminished, attenuated, feeble, and nonexistent,

source: ལེགས་པ་དགེ་བའི་རྩ་བ་ཀུན་ཏུ་སྤྱོད་པ་རྣམས་ལ་སེམས་ཞེན་པར་གྱུར་པས་སྲིད་པའི་འགྲོ་བ་གང་དང་ཕྲད་པ་དག་ཏུ་ཆུང་བར་མི་འགྱུར་རོ།
en: and as the intent on wholesome actions that are roots of virtue becomes adamant, the intention to meet with beings in the realms of existence does not wane.

source: །འཁུ་བ་དང་། གསོད་པ་དང་། འཆིང་བ་དང་། རྣམ་པར་འཚེ་བ་གང་ཡིན་པ་རྣམས་ལེགས་པར་སྤང་བ་དང་།
en: For they completely rid themselves of all harming, killing, binding, and violence,

source: འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པའི་ཁོངས་སུ་གཏོགས་པའི་སེམས་ཅན་མཐའ་ཡས་མུ་མེད་པ་རྣམས་ཀྱིས་ཐོག་མ་མེད་པའི་དུས་ནས་བསགས་པ་དུས་མཐའ་ཡས་པར་ཉམས་སུ་མྱོང་བར་འགྱུར་བའི་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བའི་སྡུག་བསྔལ་དང་། མི་སྡུག་པ་དང་ཕྲད་པ་དང་། སྡུག་པ་དང་བྲལ་བའི་སྡུག་བསྔལ་བ་དང་། འདོད་པས་ཕོངས་པའི་སྡུག་བསྔལ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དུད་འགྲོ་དང་། ཡི་དགས་དང་། སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་སྡུག་བསྔལ་གཅད་པར་བྱ་བ་དང་། དགག་པར་བྱ་བ་དང་། རྣམ་པར་ཞི་བར་བྱ་བའི་ཕྱིར་ཞུགས་པ་དང་།
en: and they apply themselves to removing, stopping, and quelling the forms of suffering that endless sentient beings in endless world systems endlessly experience, having accumulated them since beginningless time. These are the suffering of birth, aging, sickness, and death; the suffering of meeting with what is unpleasant and being separated from what is pleasant; the suffering of not having what one wants; the suffering of gods, humans, asuras, animals, pretas, and hell beings; and the suffering of attachment, aversion, and ignorance.

source: བྱམས་པའི་སེམས་སུ་གྱུར་པ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སེམས་སུ་གྱུར་པ་དང་། གོ་ཆ་ཆེན་པོ་བགོས་པ་དང་། ཐེག་པ་ཆེན་པོ་ལ་ཞུགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་ཆེན་པོ་ལ་མོས་པ་དང་། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་གྱི་གདུང་མི་འཆད་པར་ངེས་པར་བྱེད་པའི་ཕྱིར་སྡིག་པ་མི་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པ་རྣམས་ཡོངས་སུ་འགྲིབ་པར་འགྱུར་བ་དང་། ཆུང་བར་འགྱུར་བ་ནས་སྲབ་པའི་བར་དུ་འགྱུར་རོ། །ལེགས་པ་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པ་རྣམས་ནི་འཕེལ་བར་འགྱུར་བ་ནས་དཔག་ཏུ་མེད་པའི་བར་དུ་འགྱུར་རོ།
en: “Because they have a mind of loving kindness and a mind of great compassion, because they wear the great armor and have set out in the Great Vehicle, and because they are devoted to the vast teachings of the Buddha and are ensuring that the lineage of the Buddha, the Dharma, and the Saṅgha will not be broken, their unwholesome, nonvirtuous actions decrease and diminish until they are fully attenuated, and their wholesome, virtuous actions increase until they become boundless.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་སོགས་ཤིང་སྒོམ་པ་ཡང་ཡོངས་སུ་རྫོགས་པ་དང་། སྲ་བ་དང་། བརྟན་པ་དང་། རྡོ་རྗེ་ལྟ་བུར་འགྱུར་རོ།
en: Thus, their accumulation and cultivation of the bodhisattva intention becomes perfectly complete, as it becomes firm and solid like a diamond.

source: །ཚོང་དཔོན་གྱི་བུ་དེ་ལྟ་ན་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་གོ་རིམས་འདི་ལྟ་བུས་མཐར་གྱིས་སྲིད་པ་འདི་དང་། སྲིད་པ་ཕྱི་མ་དང་། སྲིད་པ་ལན་གྲངས་གཞན་དག་ལ་སྡིག་པ་མི་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པ་འགྲིབ་པར་བྱེད་པ་དང་། ཆུང་ངུར་བྱེད་པ་ནས་གསོག་ཏུ་བྱེད་པའི་བར་དང་། ལེགས་པ་དགེ་བ་ཀུན་ཏུ་སྤྱོད་པ་འཕེལ་བར་འགྱུར་བ་ནས་དཔག་ཏུ་མེད་པའི་བར་དུ་འགྱུར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་བསམ་པ་ཡང་སོགས་ཤིང་སྒོམ་པར་བྱེད་དེ།
en: “Thus, merchant son, in this life, in the next life, and for many lives thereafter, novice bodhisattvas gradually and incrementally decrease and diminish their unwholesome, nonvirtuous actions until there are none; they increase their wholesome, virtuous actions until these become boundless; and they accumulate and cultivate their bodhisattva intention.

source: ལེགས་པ་དགེ་བ་ཀུན་ཏུ་སྤྱད་པ་རྣམས་ཡོངས་སུ་སྨིན་པས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: By the ripening of their wholesome and virtuous actions, they will quickly attain unsurpassed and perfect awakening.”

source: །དེ་ནས་དེའི་ཚེ་ཡུལ་ད་ར་ད་ནས་ད་ར་དའི་རྒྱལ་པོ་སིན་དུ་གི་རི་ཞེས་བྱ་བའི་བུ་བཅོམ་ལྡན་འདས་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བཱ་རཱ་ཎ་སཱིར་སོང་ནས་དེ་བཅོམ་ལྡན་འདས་དང་ཐག་མི་རིང་བ་ཞིག་ན་འདུག་པར་གྱུར་ཏོ།
en: Now at that time, from the country of Darada, the son of King Sindhugiri of Darada had come to Vārāṇasī to see the Blessed One and to offer him his homage and veneration, and he was seated not far from the Blessed One.

source: །དེ་ནས་ད་ར་དའི་རྒྱལ་པོ་སིན་དུ་གི་རིའི་བུ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཁྱོད་ཀྱིས་ལེགས་པར་བཀའ་སྩལ་ཏོ།
en: At this moment, the son of King Sindhugiri rose from his seat, draped his upper robe over one shoulder, placed his right knee on the ground, and with his hands folded bowed to the Blessed One and said, “You have spoken well, Blessed One!

source: །བདེ་བར་གཤེགས་པ་ཁྱོད་ཀྱིས་ལེགས་པར་བཀའ་སྩལ་ཏོ།
en: You have spoken well, Sugata!
